Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་དེ་ཉིད་དེ་རུ་ནི། །རང་རྒྱལ་ཡོངས་སུ་བྱུང་བ་ནི། །འཇིག་རྟེན་རྗེས་སུ་གཟུང་འདོད་པས། །དེར་ནི་སློང་མོའི་དོན་དུ་རྒྱུ། །
en: “ ‘He came upon The blessed pratyeka­buddha, Who, out of desire to benefit the world, Was doing his alms rounds. {53.269}

source: བྱིས་པ་དེས་ནི་དེ་མཐོང་ནསསེམས་ནི་ཡང་དག་དང་གྱུར་ནས། །
en: “ ‘Upon seeing the pratyeka­buddha The boy’s mind was filled with faith.

source: རྐང་གཉིས་ལ་གཏུགས་དྲིས་པ་ནི། །དགེ་སློང་ཁྱོད་ནི་ཅི་ཞིག་བྱེད། །
en: He fell at his feet and asked, “What are you about to do, monk?” {53.270}

source: བསེ་རུ་ལྟ་བུར་སྐྱེ་བ་མེད། །བཅོམ་ལྡན་དེ་ནི་མི་སྨྲར་འདུག ། དེ་ཚེ་བྱིས་པ་དེ་ཡི་ནི། །གོས་ལ་བཟུང་ནས་ཡང་དག་གནས། །
en: “ ‘The blessed, rhinoceros-like lord Remained silent And stood there As the boy held him by the robe, [saying,] {53.271}

source: འདེང་ངོ་འདེང་ངོ་ཁྱིམ་བཟང་འདིར། །རྒྱལ་མཚན་གྱིས་ནི་རབ་མཚན་པའོ། །
en: “ ‘ “Come! Come to that fine house Adorned with a banner!

source: འདི་ནི་བདག་གི་ཁྱིམ་ཡིན་ཏེ། །
en: This is our dwelling.

source: ཞབས་བཀྲུས་ནས་ནི་བཤོས་གསོལ་ཏེ། །
en: You will wash your feet and have some food.

source: ཇི་ལྟར་དུས་བཞིན་མྱུར་གསོལ་ནས། །ཅི་འདོད་པར་ནི་རྩེ་བར་བགྱིའོ། །
en: We shall promptly eat as much as we like, And then play to our hearts’ content.” {53.272}

source: དེ་ནས་ཉེས་དང་བྲལ་བ་དེ། །ཉེས་གསུམ་མཐར་བྱེད་འཇོམས་པ་པོ། །གཞན་དག་རྗེས་གཟུང་དེ་དག་གཙོར། །མཐར་གྱིས་ཀྱང་ནི་རབ་འགྲོ་ཞིང་། །
en: “ ‘The monk, free from faults, His three stains definitively destroyed, And committed to the kind treatment of others, Followed the boy.

source: སོང་ནས་སྒོ་ཡི་རྩ་བ་ལ། །འོད་ཆེན་དེར་ནི་འདུག་པར་གྱུར། །
en: Having arrived at the door, The glorious monk waited. {53.273}

source: དེ་ནས་བྱིས་པ་ནང་ཞུགས་ནས། །མ་ལ་ཡང་ནི་འདི་སྐད་སྨྲས། །
en: “ ‘The boy entered And called out, “Mother!

source: མ་ནི་བདག་ལ་འབྲས་ཆན་སྩོལ། །བཟའ་བ་རྣམ་མང་དག་ཀྱང་སྩོལ། །
en: Please give some food for me, And also alms of various kinds. {53.274}

source: ཡུན་རིང་ས་རྡུལ་ལ་རྩེ་བའི། །བདག་གི་གྲོགས་པོ་འདིར་འོངས་གྱུར། །
en: “ ‘ “My friend has arrived here at long last, Who will play with me in the sand.

source: ཡུན་རིང་བདག་ནི་དགར་འགྱུར་བ། །སྒོར་ནི་འོངས་ནས་འདུག་པ་ཡིན། །
en: At last, you will be pleased with him; He stands waiting at the door.” {53.275}

source: དེ་ཚེ་དེ་ནི་རབ་རིངས་པར། །དེ་ཡི་མོད་ལ་སྒོར་ཡང་བྱུང་། །རྫུ་འཕྲུལ་ཆེན་པོ་ཞི་བའི་གཟུགས། །བདག་ཉིད་ཆེན་པོ་དེ་ཡང་མཐོང་། །
en: “ ‘Hastily, she came out the door, And immediately saw The distinguished person, Peaceful, and of great majesty. {53.276}

source: དེ་ཚེ་དེ་ནི་མྱུར་འོངས་ནས། །སྣོད་ནི་བཟང་པོ་བླངས་ནས་ཀྱང་། །ལག་པ་ལེགས་པར་རབ་བཀྲུས་ནས། །མེ་ཏོག་སྤོས་སོགས་སྔོན་འགྲོ་བས། །
en: “ ‘She then quickly went in, Took a fine vessel, Cleaned it with her hands, And prepared some flowers and incense. {53.277}

source: འབྲས་ཆན་གཙང་མ་བླངས་ནས་ནི། །དུ་མའི་རོ་ཡིས་རྣམ་བརྒྱན་པའི། །རྣམ་པ་སྣ་ཚོགས་བཟའ་བ་དང་། །དངུལ་གྱི་སྣོད་དུ་རབ་ཏུ་བཅུག །
en: “ ‘She took some pure rice pudding Flavored with many spices, And also different other foodstuffs, And arranged them on a silver plate. {53.278}

source: དེ་ཚེ་མྱུར་དུ་ཕྱིར་བྱུང་སྟེ། །དེ་ཡི་ལྷུང་བཟེད་ལ་བླུགས་ནས། །
en: “ ‘She then promptly returned [to the door] And placed [the articles] in the monk’s bowl.

source: ཁྱོར་བཅས་ཆོས་ལ་དད་པ་ཡིས། །དེ་ཡི་རྐང་པ་གཉིས་ལ་གཏུགས། །
en: Then she, fond of the Dharma like her son, Fell down at the monk’s feet. {53.279}

source: དེ་ཡིས་བསོད་སྙོམས་བླངས་ནས་ནི། །ནམ་མཁའ་ལ་ནི་མངོན་པར་སོང་། །དེ་ནས་དེ་ནི་རབ་འབར་ཞིང་། །མར་མེའི་ཕྲེང་བ་བཞིན་དུ་སྣང་། །
en: “ ‘The monk accepted the alms And flew up into the sky, Where he could be seen As a row of lights. {53.280}

source: བསེ་རུ་ལྟར་སྤྱོད་གང་ཡིན་པ། །དེ་དག་ངག་གིས་ཆོས་སྟོན་མིན། །
en: “ ‘The rhinoceros-like pratyeka­buddhas Do not teach the Dharma verbally.

source: རྫུ་འཕྲུལ་འོད་ཀྱིས་སེམས་ཅན་ལ། །བདག་ཉིད་ཆེན་པོ་སྟོན་པར་བྱེད། །
en: These great beings present it to others Through their magical powers. {53.281}

source: དེ་ཡང་ལྷག་པར་སྙིང་རྗེ་ཅན། །སེམས་ཅན་འགྲོ་བ་སེར་སྣར་ལྡན། །
en: “ ‘They are exceedingly compassionate Toward beings and free from selfishness.

source: ཕ་རོལ་དོན་དུ་སེམས་ཅན་ལ། །དེ་ནས་རྫུ་འཕྲུལ་སྟོན་པར་བྱེད། །
en: They reveal their supernatural power To beings with respect to future lives. {53.282}

source: དེ་ཡི་རྣམ་སྨིན་ལས་ཀྱིས་ནི། །མ་དང་ལྷན་ཅིག་བྱིས་པ་ཡང་། །སྟོང་ཕྲག་ལྔ་ཡི་སྐྱེ་བར་ནི། །ལྷ་ཉིད་ཀྱང་ནི་བྱས་པར་གྱུར། །
en: “ ‘By the ripening of this karma, The boy along with the mother Attained the state of a celestial being For five hundred births. {53.283}

source: ལྷ་རྣམས་ཀྱི་ནི་ལྷ་རྒྱལ་དེར། །མ་དེ་ཉིད་ནི་ཡང་དག་གྱུར། །
en: “ ‘He became a king of gods, And she his mother.

source: འཁོར་ལོས་སྒྱུར་ཉིད་མི་རྣམས་ཀྱི། །མི་ཡི་བདག་པོར་དེ་ཚེ་གྱུར། །
en: Then he became a human -born king, Ruling over an empire of men. {53.284}

source: ཡུན་རིང་བདེ་བ་རྗེས་མྱོང་ནས། །གཟུགས་ཅན་སྙིང་པོའི་བུར་འདི་གྱུར། །གང་གི་བཅོམ་ལྡན་དེ་སྨྲས་དང་། །གོས་ཀྱི་ཐ་མ་ལ་བཟུང་དང་། །
en: “ ‘Having enjoyed pleasures for a long time, He was born, in this world, as the son of Bimbisāra, The same one who had grabbed the blessed [monk] By the robe and pulled him. {53.285}

source: ཚིག་ངན་སྨྲ་བ་སྨྲས་པ་ནི། །དགེ་སློང་སྨྲ་བས་སྨྲས་པ་དང་། །ས་རྡུལ་བདག་དང་རྩེ་བ་ཞེས། །དེ་ཚེ་སྔོན་ནི་ཁྱོད་ཅེས་སྨྲས།
en: “ ‘You, however, spoke improper words When addressing a monk, Saying, at that time, “Be my playmate in the sand.” {53.286}

source: གི་ལས་ནི་དེ་ཡིས་ནི། །མི་འདོད་པ་དང་ཚ་བ་ཡི། །དྲག་ཅིང་རབ་ཚའི་སྡུག་བསྔལ་བ། །ཡུན་རིང་མང་པོ་རྗེས་མྱོང་བ། །མི་འདོད་སྡུག་བསྔལ་བཟོད་དཀའ་བ། །མི་བཟད་དམྱལ་བར་ལྟུང་བར་འགྱུར། །
en: “ ‘Based on the past karma of those words, Undesirable and rude, You experienced, for a long time, An intense and acute suffering, Falling, against your wishes, into the terrible hell Where the pain is difficult to bear. {53.287}

source: ལས་ཀྱི་ཞགས་པས་བཅིངས་ནས་ནི། །སེམས་ཅན་ངན་འགྲོར་འགྲོ་བར་འགྱུར། །
en: “ ‘Ensnared thus in the trammels of karma, Beings follow painful destinies.

source: རྒོད་པས་ལས་ནི་བྱེད་པ་ཡིས། །དུ་བས་རྗེས་སུ་མྱོང་བར་འགྱུར། །
en: One creates karma laughing, But experiences it crying. {53.288}

source: དེ་བཞིན་བྱིས་པའི་རང་བཞིན་གྱིས། །ཉན་ཐོས་རྒྱལ་བ་སྐྱོབ་པ་ལ། །
en: “ ‘Because of your former childish attitude Toward a savior, a pratyeka­buddha,

source: ཚིག་ནི་མ་རུངས་རྒྱ་ཆེ་བ། །དེ་ཡི་ལས་ནི་འདི་འདྲ་འོ། །
en: You spoke improper words, Thus creating the corresponding karma. {53.289}

source: དམྱལ་བ་ལས་ནི་ཐར་ནས་ཀྱང་། །མི་ཉིད་དུ་ནི་འདིར་ཡང་འོངས། །རྣམ་སྨིན་སྐྱེས་པ་མི་ཡི་བདག །དམྱལ་བ་ཡང་ནི་དྲན་པར་གྱུར། །
en: “ ‘Having left the hell realm, You became human and arrived here, But your consciousness, O king, Was still in a hell born of karmic ripening. {53.290}

source: དེ་ཡི་ཁྲོ་བ་བདོ་བ་ཡིས། །ཁྱོད་ཀྱིས་ཕ་ཡི་སྲོག་ཀྱང་བཅད། །
en: “ ‘Because of this and your violent anger, You were predisposed to kill your father.

source: རང་རྒྱལ་དག་གི་སྤྱོད་པ་ཡང་། །སྔོན་གྱི་བག་ཆགས་ཀྱིས་དྲན་པས། །སངས་རྒྱས་མངོན་སུམ་མཐོང་ནས་ནི། །སྐྱེ་དགུ་དག་ཀྱང་དེ་བཞིན་བྱས། །
en: Similarly, because of a pre-existing karmic trait Created by serving a pratyeka­buddha, You met the Buddha in person And you worshiped him. {53.291}

source: དེ་ཉིད་རྒྱུ་ནི་དྲན་བྱས་པས། །འདིར་ནི་རྒྱལ་ཐབས་ཉིད་ཀྱང་བྱས། །
en: “ ‘By the same cause of [serving a pratyeka­buddha], You have obtained a kingdom in this [world].’

source: དེ་ལྟར་འོད་མའི་ཚལ་དུ་ནི། །ཕན་ཚུན་དེ་དག་ས་སྟེང་སྨྲ། །
en: Thus will the two of them converse In the Bamboo Grove on earth. {53.292}

source: ང་ཡི་སློབ་མ་མཆོག་འདི་དང་། །གཉིས་པ་མི་ཡི་བདག་པོ་ཡིས། །མཆོད་རྟེན་ལན་བརྒྱར་ཕྱག་འཚལ་ནས། །དེ་ཚེ་རང་གི་ཁྱིམ་དུ་སོང་། །
en: “The first one, my foremost disciple, And the second one, the king, Will bow to the stūpa hundreds of times And then go each to his own home. {53.293}

source: དེ་ནས་སློབ་མའི་མཆོག་གྱུར་པ། །པི་པལ་ཕུག་ན་གནས་པ་དེ། །རྫུ་འཕྲུལ་ཆེན་པོ་འདོད་ཆགས་བྲལ། །ཐུབ་པ་མ་ལུས་འདུས་ནས་ནི། །
en: “My foremost disciple, Who shelters under the pipal tree, Will call a meeting of the sages, All of them free from desire and very dignified. {53.294}

source: གསུང་རབ་ཡན་ལག་བཅུ་གཉིས་དང་། །འདུལ་བ་མ་ལུས་སྡུད་པར་བྱེད། །
en: “The entire doctrine with its twelve branches, Along with the Vinaya, will be recited there—

source: གང་ཞིག་ཆོས་ནི་ངས་བསྟན་དང་། །དེ་བཞིན་སྔོན་གྱི་རྒྱལ་བ་མཆོག །
en: The Dharma that I have taught, And that which was formerly taught by other victors. {53.295}

source: དེ་ནས་སློབ་མའི་མཆོག་དེས་ཀྱང་། །རྣམ་པ་གསུམ་དུ་ཡང་དག་བསྟན། །འདུལ་བ་དང་ནི་མངོན་པ་དང་། །མདོ་སྡེའི་དབྱེ་བས་གཞུང་དུ་བྱས། །
en: “The doctrine will be presented By the foremost disciple as threefold, With its scriptures divided into Sūtra, Vinaya, and Abhidharma. {53.296}

source: སེམས་ཅན་འཆིང་བ་གསུམ་ལས་བཀྲོལ། །ཉེས་པ་གསུམ་ཡང་སྐེམ་པར་བྱེད། །དཔའ་བོ་སྡུག་བསྔལ་གསུམ་ལས་འགྲོལ། །རྟག་ཏུ་ཐེག་པ་གསུམ་ལ་དགོད། །
en: “The wise [Mahākāśyapa] will release beings From the three fetters, dry up their three faults, Free them from the three sufferings, And establish them in the three vehicles. {53.297}

source: སངས་རྒྱས་རྣམས་ཀྱིས་བསྟན་པའི་དོན། །བློ་ཡི་མཆོག་ནི་བྱེད་པར་འགྱུར། །
en: “The sagacious one will thus Further the cause of the buddhas’ teachings.

source: རྒྱལ་ཆེན་མ་སྐྱེས་དགྲ་ཞེས་པའི། །མ་ག་དྷཱ་པ་མི་ཡི་བདག །ཨང་ག་མ་ག་དྷཱ་དང་ནི། །བཱ་རཱ་ཎ་སཱི་དེ་ལས་གཞན། །བྱང་དུ་ཡངས་པ་ཅན་དང་ནི། །
en: As for the king of the Magadhans, The great monarch Ajātaśatru, {53.298} “He will extend his rule over the entirety of Magadha and Aṅga, After that over Vārāṇasī, And then over Vaiśālī to the north.

source: རྒྱལ་ཆེན་སྟོབས་པོ་ཆེ་བར་ནི། །ཐེ་ཚོམ་མེད་པར་འགྱུར་བ་ཡིན། །བསྟན་པའི་དོན་ནི་བྱེད་པར་འགྱུར། །
en: He will become a very powerful king {53.299} “Who will advance the cause of the teachings, Of this there is no doubt.

source: གཞོན་ནུ་ཁྱོད་ནི་འདུལ་བྱེད་ཅིང་། །ཞི་བ་དམ་པ་སྟོན་པར་འགྱུར། །
en: He is prophesied to attain the ultimate peace, After being instructed by you, divine youth. {53.300}

source: དེ་ཡི་བུ་ཡང་རྒྱལ་པོ་ནི། །ཡི་གེ་ཨུ་ཞེས་བྱ་བར་བསྒྲགས། །དེ་ཚེ་འབྱུང་བར་འགྱུར་བ་ནི། །མྱུར་དུ་བསྟན་པའི་དོན་ལ་བརྩོན། །
en: “His son, the king known By the initial U, Will also become, before long, Actively engaged in promoting the teachings. {53.301}

source: དེས་ནི་སྟོན་པའི་གསུང་རབ་འདིར། །རྒྱ་ཆེར་འདྲི་བར་བྱེད་འཇུག་འགྱུར། །
en: “He will have these teachings Committed to writing in their entirety.

source: མཆོད་པ་ཆེན་པོའང་བྱས་ནས་ནི། །ཕྱོགས་རྣམས་ཀུན་ཏུ་རྒྱས་པར་བྱེད། །
en: After worshiping [the volumes] with many offerings, He will distribute them throughout the quarters. {53.302}

source: ཕྱིར་ཡང་ངན་སོང་འདི་མི་འགྲོ། །
en: “Later he will not suffer a low rebirth,

source: ལྷར་སྐྱེ་བར་ནི་དེ་འགྱུར་རོ། །
en: But will be reborn among gods,

source: ལོ་ནི་ཉི་ཤུ་སུམ་ཅུར་ནི། །ཕ་དང་ལྷན་ཅིག་འགྲོགས་པར་འགྱུར། །
en: After twenty or thirty years Spent among the pitṛs. {53.303}

source: གྲོང་ཁྱེར་སྟོབས་ལྡན་མཚན་ཕྱེད་དུ། །རིགས་ལས་སྐྱེས་པའི་ནད་ཀྱིས་ནི། །མངོན་པར་ཟིལ་གྱིས་ནོན་པར་འགྱུར། །
en: “His earthly existence Will end at midnight, When he will succumb to a disease That runs in his family. {53.304}

source: ཉིན་ཞག་སུམ་ཅུ་རྩ་དྲུག་ཏུ། །ནད་ཆེན་དག་གིས་ཉམ་ཐག་འགྱུར། །
en: “For twenty-six days He will suffer the pain of this terrible disease.

source: ནད་རྣམས་ཀུན་གྱིས་བཏབ་ནས་དེ། །རྣམ་པ་སྣ་ཚོགས་བརྒྱལ་ནས་ནི། །
en: Affected by all manner of illnesses, He will be incapacitated in different ways. {53.305}

source: རྒྱལ་པོ་དེ་མྱུར་ཤི་འཕོས་ནས། །ལྷ་རྣམས་སུ་ནི་སྐྱེ་བར་འགྱུར། །
en: “He will thus pass away And swiftly be reborn among the gods.

source: དེ་ནི་མཐར་གྱིས་འབད་ནས་ནི། །ངེས་པར་བྱང་ཆུབ་ཐོབ་པར་འགྱུར། །
en: With effort and care, in due course, He will certainly attain realization. {53.306}

source: འདི་དང་གཞན་ཡང་མང་པོ་ནི། །འདས་པ་དང་ནི་མ་འོངས་པར། །རང་རྒྱལ་སྐྱོབ་པ་དག་ལ་ནི། །རྣམ་པ་སྣ་ཚོགས་བྱས་པ་ཡིས། །
en: “These and many other kings, Those in the past and the future, Having done various services For the pratyeka­buddhas and the victorious saviors, {53.307}

source: དེ་བཞིན་ལྷ་དང་མི་རྣམས་ཀྱིས། །འདོད་དང་ཁྱད་པར་ཕུན་ཚོགས་འཐོབ། །དེ་དག་མཐར་གྱིས་འགྲོ་འགྱུར་བ། །ཞི་བ་ནད་མེད་གོ་འཕང་འཐོབ། །
en: “Obtain the wished-for extraordinary fortunes, Whether divine or human, And, in due course, attain peace— The blessed state free from decay. {53.308}

source: རྒྱལ་པོ་མཆོག་དང་དམན་པ་དང་། །མི་ཡི་བདག་པོ་བར་མ་རྣམས། །རྒྱལ་པོ་ན་ཧུ་ཤ་ལ་སོགས། །དང་པོའི་དུས་སུ་བསྟན་པ་དག །
en: “Kings can be of three categories, Higher, middling, or inferior. The kings said [to have ruled] in the first eon Are those of the Nahuṣa and Pārthiva lines. {53.309}

source: ངེས་པར་དེ་དག་སངས་རྒྱས་གྱུར། །ཁ་ཅིག་ཉན་ཐོས་ཐེག་པ་ལ། །ངེས་པར་ཁ་ཅིག་ཉན་ཐོས་ཉིད། །དེ་ཀུན་ཐར་ལ་མངོན་པར་གཞོལ། །དུས་ཀྱི་རྣམ་གཞག་རྗེས་མཐུན་པར། །ཚེ་ཡང་རྣམ་པར་བརྟག་པ་ཡིན། །
en: “Some are destined to become buddhas, While others pursue the pratyeka­buddha path. Some are destined to become śrāvakas. All of them are on course toward liberation. {53.315} “As for their lifespans, They are divided into [three] categories.

source: དམ་པ་ཚེ་ཡང་རིང་བ་སྟེ། །དེ་བཞིན་བར་མ་བར་མ་ཡིན། །
en: The superior ones have long lifespans, The middling have middling ones, {53.316}

source: ཤིན་ཏུ་དཀའ་བའི་དུས་མཐའ་ལ། །དུས་ཀྱི་ཐ་མ་རྩོད་དུས་ལ། །རྒྱལ་པོ་རྩོད་པ་ལ་དགའ་བས། །གཞན་ནི་ཐ་མར་བསྟན་པ་ཡིན། །
en: “But in the final eon, The wretched and debased age of strife, The kings will have short lifespans And be fond of discord. {53.317}

source: ཕན་ཚུན་ཁོ་ན་དུ་འཛིན་ཆགས་པས། །གཅིག་ལ་གཅིག་ནི་རྣམ་འཚེ་བྱེད། །
en: “They will be given to mutual enmity And inflicting harm on one another.

source: དམན་པའི་སྐྱེ་བ་ཐོབ་པ་དང་། །མཚོན་གྱི་རེག་པས་འཆི་བར་འགྱུར། །མཚོན་གྱིས་འཚོ་བས་ཡང་དག་དག་དགའ། །དེ་བཞིན་གཞན་གྱི་བུད་མེད་ཆགས། །
en: They will be of inferior birth And will provoke armed conflicts. {53.318} “At that time, they will be eager to use weapons And will take pleasure in [seducing] others’ wives.

source: རྒྱལ་པོ་འཇིག་རྟེན་སྨོད་པར་ནི། །ཐེ་ཙོམ་མེད་པར་འགྱུར་བ་ཡིན། །
en: There is no doubt that such kings will come, Reviled by the world. {53.319}

source: གཡོན་ཅན་ལས་ངན་ཅན་དང་ནི། །དེ་བཞིན་འཕགས་མིན་སེར་སྣ་ཅན། །དེ་ཡི་ཚེ་ན་འབྱུང་བར་འགྱུར། །
en: “They will be wicked, vulgar, and selfish, And will engage in evil acts.

source: གཞོན་ནུ་དེ་ནི་རྟོགས་པར་གྱིས། །དུས་གང་འབྱུང་བར་འགྱུར་བ་ན། །
en: This will come to pass Between the dvāparayuga and kaliyuga. {53.320}

source: ས་སྟེང་རྒྱལ་པོ་འབྱུང་བ་ཡི། །དེ་དག་གཟུགས་དང་མཚན་མ་དང་། །ཁ་དོག་ཀྱང་ནི་རྟོགས་པར་གྱིས། །ཀོ་སའི་རྒྱལ་པོ་གསལ་རྒྱལ་དང་། །གཟུགས་ཅན་སྙིང་པོ་དེ་བཞིན་གཞན། །རྒྱལ་རིགས་གཙོ་བོ་འཆར་བ་དང་། །དམག་བརྒྱ་པ་ནི་ཡང་དག་འབྱུང་། །ལག་བཟང་གཞུ་བཟང་ཞེས་བྱ་དང་། །དེ་བཞིན་དབང་ཆེན་ཙ་མ་ཤ། །དེ་བཞིན་ལིཙྪ་བཱིར་སྐྱེས་པའི། །ཤཱཀྱའི་རིགས་སྐྱེས་སེང་གེ་དང་། །ཆེར་ལྡན་གསལ་དང་རབ་གསལ་དང་། །སྡེ་ཆེན་དུ་ཡང་བསྟན་པའོ། །
en: Listen, divine youth! {53.321} “Learn about the features and marks Associated with their caste. Prasenajit is the king of Kośala; Bimbisāra is another king. {53.322} “Udayana, the son of Śatānīka, Is a distinguished kṣatriya. There are also Subāhu, Sudhana, Mahendra , and Candrasama. {53.323} “Siṃha of the Licchavi clan Was born in Vaiśālī. In Ujjain, there are Udayana, Vidyota, Pradyota, and Mahāsena. {53.324} “In Ujjain there is Caṇḍa.

source: དེ་བཞིན་འཕགས་རྒྱལ་གཏུམ་པོ་དང་། །སེར་སྐྱའི་གྲོང་གི་རྒྱལ་པོ་ནི། །ཟས་གཙང་ཞེས་ནི་བྱ་བ་དང་། །དཔའ་བོ་ཞེས་བྱ་སྟོབས་ཆེན་དག །
en: In the city of Kapilavastu There is the king Śuddhodana And the powerful Vairāṭa. {53.325}

source: འདི་དག་རྒྱལ་པོའི་རིགས་སུ་གསུངས། །ས་སྲུང་སྟོན་པ་མཆོད་བྱེད་པའོ། །
en: “These kings are said to be kṣatriyas And worshipers of the Teacher.

source: ཤཱཀྱ་སེང་གེ་མི་ཡི་མཆོག །སངས་རྒྱས་མངོན་དུ་ལྟ་བར་འགྱུར། །
en: They have seen the Buddha, the supreme person, directly, In his [present existence] as the Lion of the Śākyas. {53.326}

source: དེ་ཡང་དེ་ནས་ཆོས་ཐོས་ནས། །ཡུན་རིང་ཕུན་སུམ་ཚོགས་པ་འཐོབ། །ངེས་པར་བྱང་ཆུབ་འདོད་ནས་ཀྱང་། །ཤི་ནས་ཞི་བ་འཐོབ་པར་འགྱུར། །
en: “Having heard the Dharma, They will obtain lasting good fortune, And if they desire liberation, They will definitely attain the peace of nirvāṇa. {53.327}

source: ས་བདག་ས་ཡི་དཀྱིལ་འཁོར་དུ། །འདི་དག་འཇིག་རྟེན་རྣམ་པར་གྲགས། །
en: “The kings just listed, known to the world, Belong to the earthly realm.

source: རིགས་ནི་རྒྱལ་རིགས་དག་ཏུ་བསྟན། །འདུ་ཤེས་མིང་གིས་མཚོན་པ་ཡིན། །
en: Regarding their caste, they are said to be kṣatriyas, And as for their identification, they are known by their name. {53.328}

source: ས་སྟེང་ང་ཡིས་བསྟན་པའི་ཚིག །དེ་དག་མཆོད་པ་བྱེད་པར་འགྱུར། །
en: “One of them will worship your teachings, Which I have given on earth.

source: གཞོན་ནུ་བྱིས་པའི་གཟུགས་ཅན་གྱིས། །ཁྱོད་ཀྱིས་འཇིག་རྟེན་ལུང་བསྟན་པ། །མ་སྐྱེས་ཞེས་བྱའི་རྒྱལ་པོ་དེ། །ངེས་པར་བྱང་ཆུབ་གཞོལ་བར་འགྱུར། །
en: He was predicted by you, Divine youth beautiful as a child, As the one called Ajātaśatru, Who will dedicate himself to the goal of awakening. {53.329}

source: ང་ནི་ས་སྟེང་མྱ་ངན་འདས། །ལོ་བརྒྱ་དག་ནི་འདས་པ་ན། །སྣང་བ་མེད་ཅིང་ཉེས་པར་བཅས། །མི་ཤེས་མུན་པས་རབ་ཏུ་བསྒྲིབས། །དེ་ཚེ་ས་ནི་སྟོངས་པ་སྟེ། །རྒྱལ་བ་རྣམས་ཀྱིས་སྤངས་པ་ཡིན། །
en: “One hundred years after My parinirvāṇa on earth, When there is no light or joy And the darkness of ignorance descends, When the earth is empty Without the Victorious One, {53.330}

source: དེ་ཚེ་མི་བཟད་ཆེན་པོ་ཡི། །གྲོང་ཁྱེར་མེ་ཏོག་ཅན་དུ་ནི། །མྱ་ངན་མེད་ཅེས་བྱ་བ་ཡི། །རྒྱལ་པོ་ས་ནི་སྐྱོང་བྱེད་པ། །ཁྲོ་བཅས་ལས་ནི་དྲག་པོ་བྱེད། །དེ་ཚེ་དེ་ནི་སྙིང་རྗེ་མེད། །
en: “At that terrible time, In the city called Kusumapura, There will be a king who rules that land, Known by the name Aśoka. He will be severe in his actions, Tempestuous, and pitiless. {53.331}

source: རྫུ་འཕྲུལ་ཆེན་པོ་འདོད་ཆགས་བྲལ། །ནད་མེད་སེར་སྣ་བྲལ་བ་དང་། །དགེ་སློང་ཚུལ་ཁྲིམས་ལྡན་པ་ཡི། །དགེ་བའི་བཤེས་གཉེན་ཐད་དུ་ལྷགས། །སྔོན་གྱི་བག་ཆགས་རྒྱུ་དང་ནི། །ས་རྡུལ་བྱིན་པའི་བྱིན་རླབས་ཀྱིས། །རིགས་ནི་ངེས་པར་འགྱུར་བ་དང་། །རྒྱལ་པོ་ནོར་ཆེན་ལྡན་པར་འགྱུར། །
en: “He will, however, meet a virtuous friend Who is free from desire and dignified, A monk endowed with discipline Whose mind is free from the fever [of afflictions]. {53.332} “Because of the karmic predisposition from the past Formed through a gift of dust to the dignified [ Sage ], This king will be destined To own vast land and great wealth.

source: ཆོས་དང་ཆོས་མིན་རྣམ་དཔྱོད་ཅིང་། །བརྩེ་ལྡན་སྙིང་རྗེ་ལྡན་པ་དང་། །
en: He will also understand what is right and what is wrong, And he will become gentle and compassionate. {53.333}

source: ཆགས་བྲལ་རྫུ་འཕྲུལ་ཆེན་པོ་དེས། །རྒྱུ་ནི་ཕྱེ་ཞིང་བསྟན་པར་བྱས། །
en: “Revealing the underlying cause, The monk, free from desire and very dignified, Will say,

source: སྔོན་ནི་ཁྱོད་ཀྱང་རྒྱལ་པོ་སྟེ། །མི་ཤེས་བྱིས་པ་གཡོ་བ་ཡི། །རྒྱལ་བ་ཤཱཀྱ་སེང་གེ་ལ། །ས་ཡི་རྡུལ་ནི་སྙིམ་གང་ཕུལ། །ཞིང་དེ་ལ་ནི་རབ་ཕུལ་བས། །
en: ‘You, O king, in a former life, Acting innocently with childlike flightiness, {53.334} “ ‘Presented at that time, with folded hands, Some dust to the victorious Lion of the Śākyas, Placing it in his bowl as food.

source: ལྷ་ཡུལ་ཕུན་སུམ་ཚོགས་པ་ཐོབ། །
en: Because of this, you attained a divine state, {53.335}

source: ལྷ་ཡི་འཇིག་རྟེན་ཤི་འཕོས་ནས། །ས་ཡི་འཇིག་རྟེན་འདིར་འོངས་གྱུར། །
en: “ ‘And then, having departed from the celestial realm, You took birth here, in the world of your ancestors.

source: འཛམ་གླིང་ནགས་ཚལ་ཕུན་སུམ་ཚོགས། །རྒྱལ་པོ་ཡི་ནི་རྒྱལ་ཐབས་སྤྱོད། །
en: Enjoy the dominion, O king, Over Jambūdvīpa with its pleasant groves!’ {53.336}

source: བདག་ཉིད་ཆེན་པོ་ཛམ་བྷ་ལ། །གནོད་སྦྱིན་གྱི་ནི་སྔགས་ཀྱང་བསྒྲུབས། །
en: “The great king will practice The mantra of the great yakṣa Jambhala.

source: བདག་ཉིད་ཆེན་པོ་ས་ཡི་བདག །དེ་ནས་གནོད་སྦྱིན་ཤིང་རྟ་གྲུབ། །
en: After he becomes accomplished, He will obtain a chariot drawn by spirits. {53.337}

source: དེ་ལ་གནོད་སྦྱིན་འདུག་པ་ནི། །བཀའ་དང་མཐུན་པར་ཡིད་ཀྱང་འཇུག །
en: “He will be attended upon by the yakṣa s, Who anticipate his orders.

source: ཀླུ་རྣམས་ཀྱང་ནི་འདུག་པ་སྟེ། །བྲན་དང་བཀའ་བཞིན་བྱེད་པའི་རྒྱུ། །
en: The nāga s will attend upon him too, Duly awaiting his orders. {53.338}

source: དེ་ལྟར་རྫུ་འཕྲུལ་ཆེ་བདག་ཉིད། །དེ་ཚེ་སྟོབས་ཀྱི་འཁོར་སྒྱུར་འབྱུང་། །ཅི་འདོད་དེ་ནི་འགྲོ་བ་ན། །གང་དུའང་འགོག་པ་མེད་པར་འགྱུར། །
en: “Devoted to the Dharma, Aśoka will attain great majesty, And he will exercise the powers of a sovereign, Traveling wherever he pleases Without ever being obstructed. {53.339}

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོག་ས་ལ། །གང་ཡང་སྔོན་ནི་རབ་བཞག་པ། །རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་གྱི། །དེ་ཚེ་འོད་མའི་ཚལ་དུའོ། །
en: “He will take, at that time, from the city of Rājagṛha, From the grove called the Bamboo Grove, The finest relics of the victorious ones on earth, Which had been placed there in earlier times. {53.340}

source: སྐུ་གདུང་མཆོག་ནི་བླངས་ནས་ཀྱང་། །དགེ་བ་ལ་དམིགས་ཡིད་ཅན་གྱིས། །ཇི་ལྟར་སྔོན་གྱི་བྱས་པ་བཞིན། །མཆོད་རྟེན་དེ་ལ་མཆོད་པ་བྱས། །
en: “With his mind steeped in virtue, He will take the relics from their container And then worship the stūpa, Just as was done in the past. {53.341}

source: སྐུ་གདུང་བུམ་པ་དེ་བླངས་ནས། །དེ་ནི་དེ་བཞིན་རྣམ་བགོས་ནས། །བློ་ལྡན་དེས་ནི་སྐད་ཅིག་གིས། །དེ་ནས་གནོད་སྦྱིན་ལ་ཡང་སྨྲས། །
en: “He will take out the jar containing the relics and, Having divided them into one hundred parts, That wise one will immediately command The yakṣa s as follows: {53.342}

source: འཛམ་བུའི་གླིང་འདི་མ་ལུས་པ། །མཆོད་རྟེན་རྒྱན་གྱིས་བརྒྱན་པ་དང་། །
en: “ ‘Gentlemen, please adorn The entirety of Jambūdvīpa with stūpas.

source: ས་རྣམས་སྐུ་གདུང་སྙིང་པོར་ནི། །ཁྱོད་ཀྱིས་ཀྱང་ནི་རབ་ཏུ་བྱ། །
en: You must make the earth Into a receptacle of relics.’ {53.343}

source: འབད་པ་ཡིས་ནི་མཚན་ཕྱེད་དུ། །གནོད་སྦྱིན་གྱིས་ནི་བཀའ་ཡང་བླངས། །མི་མ་ཡིན་པའི་བྱ་བ་བྱས། །ས་སྟེང་རྡོ་ཡི་སྲོག་ཤིང་བསྒྲེང་། །ཀ་བ་སྟོང་ཕྲག་དུ་མ་ནི། །
en: “Having received their orders, The yakṣa s, carefully at midnight, Using for this task nonhuman labor, Will erect stone pillars throughout the land. {53.344}

source: དེ་ཚེ་ཡོངས་སུ་བཙུགས་པར་གྱུར། །མཆོད་རྟེན་རྣམས་ལ་མཆོད་དོན་དུ། །ལུས་ཅན་རྣམས་ལ་མཚོན་པར་གྱུར། །
en: “They will erect, at that time, Many thousands of pillars Serving as signposts for living beings For their worship of the caityas. {53.345}

source: འཇིག་རྟེན་མགོན་པོ་སྐྱོབ་པ་ཡིས། །མཆོད་རྟེན་སྣ་ཚོགས་བྱས་ནས་ནི། །སྐད་ཅིག་གཅིག་གིས་གནོད་སྦྱིན་རྣམས། །རྒྱལ་པོ་ཡི་ནི་དྲུང་དུ་ལྷགས། །
en: “Having thus constructed various stūpas Dedicated to the lord protectors of the world, The yakṣa s will instantly return To the side of the king, [Aśoka]. {53.346}

source: དེ་ནས་གནོད་སྦྱིན་རབ་བཏུད་ནས། །དབེན་པར་ཚིག་ནི་རབ་ཏུ་སྨྲས། །
en: “Bowing their heads to him, The guhyakas will say,

source: ཇི་སྐད་བཀའ་སྩལ་མ་ལུས་བྱས། །
en: ‘We have done everything exactly as instructed.

source: ས་བདག་ཇི་སྟེ་གཟིགས་མི་མཛད། །
en: Will you not have a look, O lord?’ {53.347}

source: དེ་ནས་མྱུར་དུ་ས་བདག་དེ། །དེ་ཚེ་ཤིང་རྟ་དེ་ལ་ཞོན། །
en: “The king will then quickly Mount his chariot,

source: རྣམ་པ་སྣ་ཚོགས་མཆོད་དོན་དུ། །རྣམ་པ་སྣ་ཚོགས་མཛེས་པའི་ཕྱིར། །
en: Taking with him various things to offer And adornments of many kinds. {53.348}

source: གསེར་དང་དེ་བཞིན་དངུལ་དག་དང་། །རྣམ་པ་སྣ་ཚོགས་མཆོད་རྟེན་བརྒྱན། །དེ་ནས་གནོད་སྦྱིན་ཤིང་རྟ་དང་། །མྱུར་དུ་རྒྱལ་པོ་རབ་ཏུ་སོང་། །
en: “He will thus quickly fill The spirit-drawn chariot With gold, silver, copper, And various adornments for the stūpas. {53.349}

source: གང་ན་རྒྱལ་བའི་མཆོད་རྟེན་ཡོད། །སྐད་ཅིག་གིས་ནི་དེ་ཡུལ་དུའོ། །རྣམ་པ་སྣ་ཚོགས་མཆོད་པ་ཡིས། །རྒྱལ་པོ་དེས་ནི་དེ་ལ་མཆོད། །
en: “Within a moment, the king Will worship the victorious ones With manifold articles At the locations where their reliquaries will be. {53.350}

source: དེ་ཚེ་རྒྱལ་བའི་མཆོད་རྟེན་གྱིས། །ས་རྣམས་མ་ལུས་མཛེས་པར་བྱས། །བདག་ཉིད་ཆོས་རྒྱལ་མྱ་ངན་མེད། །སྨོན་ལམ་དག་ནི་འདེབས་པར་བརྩོན། །
en: “At that time, when all the land has been adorned With the relics of the victorious ones, The king, the righteous and noble Aśoka, Will make the following aspiration:

source: དགེ་བའི་རྩ་བ་འདི་དོན་གྱིས། །བླ་ན་མེད་པའི་སངས་རྒྱས་ཤོག །
en: ‘By the power of this merit May I become a supreme buddha.’ {53.351}

source: དེ་བཞིན་དེས་ཀྱང་རིག་ནས་ནི། །རྒྱལ་པོ་ཆོས་ནི་སྟོན་པར་བྱེད། །
en: “Remembering this, The noble, righteous king Aśoka

source: དེ་ནི་ཤི་ནས་ལྷ་རུ་འགྲོ། །ངེས་པར་བྱང་ཆུབ་གཞོལ་བར་འགྱུར། །
en: Will become a god after he dies, Steadily progressing toward awakening. {53.352}

source: ལོ་ནི་བརྒྱད་ཅུ་རྩ་བདུན་དུ། །ས་སྟེང་མཆོད་རྟེན་མཆོད་པར་འགྱུར། །
en: “On earth, he will worship The supreme relics for eighty-seven years.

source: ལོ་ནི་བརྒྱ་དང་ལྔ་བཅུར་འཚོ། །གནོད་པ་མེད་པའི་རྒྱལ་ཐབས་བྱེད། །
en: He will live for one hundred and fifty years, During which he will rid his kingdom of troubles. {53.353}
